---
kind: type
id: T:Autodesk.Revit.Attributes.JournalingMode
source: html/fb11f6be-d1e2-728a-9c43-26ae89c8cc7c.htm
---
# Autodesk.Revit.Attributes.JournalingMode

All journaling modes supported by Revit external commands.

## Syntax (C#)
```csharp
public enum JournalingMode
```